#include <iostream>
#include "Date.h"

int main() {
    // Включение поддержки русского языка в консоли Visual Studio
    setlocale(LC_ALL, ".UTF-8");

    // ПУНКТ 1) Тест конструкторов
    Date d1; // По умолчанию (01.01.2000)
    Date d2(26, 10, 2026); // Конструктор с параметрами
    std::cout << "1) Тест :\n";
    std::cout << "   Дата по умолчанию (d1): "; d1.print();
    std::cout << "   Заданная дата (d2): "; d2.print();

    // ПУНКТ 4) Тест аксессоров (геттеры и сеттеры)
    std::cout << "\n4) Тест аксессоров:\n";
    std::cout << "   Старый год d1: " << d1.getYear() << "\n";
    d1.setDate(7, 1, 2024); // Меняем дату с помощью сеттера
    std::cout << "   Новая дата d1 после сеттера: "; d1.print();

    // ПУНКТ 2) Тест ввода/вывода
    std::cout << "\n2)  ручной ввод даты d1:\n";
    d1.read();
    std::cout << "   Вы успешно ввели дату: "; d1.print();

    std::cout << "\n=====================================================\n";
    return 0;
}
