#pragma warning(disable : 4996)
#include <iostream>
#include "Date.h"

int main() {
    // Включение поддержки русского языка в консоли Visual Studio
    setlocale(LC_ALL, ".UTF-8");

    // ПУНКТ 1) Тест конструкторов
    Date d1; // По умолчанию (01.01.2026)
    Date d2(30, 10, 2026); // Конструктор с текущей датой
    std::cout << "1) Тест :\n";
    std::cout << "   Дата по умолчанию (d1): "; d1.print();
    std::cout << "   Заданная дата (d2): "; d2.print();

    // ПУНКТ 4) Тест аксессоров (геттеры и сеттеры)
    std::cout << "\n4) Тест аксессоров:\n";
    std::cout << "   Старый год d1: " << d1.getYear() << "\n";
    d1.setDate(30, 10, 2026); // Меняем дату на сегодняшнюю с помощью сеттера
    std::cout << "   Новая дата d1 после сеттера: "; d1.print();

    // ПУНКТ 2) Тест ввода/вывода
    std::cout << "\n2)  ручной ввод даты d1:\n";
    d1.read();
    std::cout << "   Вы успешно ввели дату: "; d1.print();

    std::cout << "\n=====================================================\n";

    std::cout << "\n3) Время года для введенной даты: " << d1.getSeason() << "\n";

    std::cout << "\n5) Проверка года:\n";
    std::cout << "   Является ли год введенной даты високосным? " << (d1.isLeapYear() ? "Да" : "Нет") << "\n";

    std::cout << "\n6) От начала года до этой даты прошло: " << d1.daysFromStartOfYear() << " дн.\n";

    // ПУНКТ 7) Проверка на праздничный день
    std::cout << "\n7) Является ли этот день официальным праздником? " << (d1.isHoliday() ? "Да" : "Нет") << "\n";

    // ПУНКТ 8) Проверка совпадения дат через перегруженный оператор ==
    std::cout << "\n8)  совпадения через оператор '==':\n";
    if (d1 == d2) {
        std::cout << "   Результат: Даты совпадают.\n";
    }
    else {
        std::cout << "   Результат: Даты разные.\n";
    }

    // ПУНКТ 9) Количество дней, оставшихся до нового года
    std::cout << "\n9) До Нового года от введенной даты осталось: " << d1.daysUntilNewYear() << " дн.\n";

    // ПУНКТ 10) Сколько дней между двумя датами через оператор -
    std::cout << "\n10) Вычисление разности через оператор '-':\n";
    int diff = d1 - d2;
    std::cout << "    Разница между введенной датой и 30.10.2026: " << diff << " дн.\n";

    // ПУНКТ 11) Сравнение с текущей датой
    // Передадим в качестве "сегодня" реальную текущую дату: 30 октября 2026 года
    std::cout << "\n11) Относительно сегодняшнего дня (30.10.2026) введенная дата — это: ";
    std::cout << d1.compareWithCurrent(30, 10, 2026) << "\n";

    // ПУНКТ 12) Проверить попадание в заданный временной промежуток
    std::cout << "\n12) Проверка попадания в отрезок времени:\n";
    Date startPeriod(1, 1, 2026); // Сузили диапазон до текущего года для наглядности
    Date endPeriod(31, 12, 2026);
    std::cout << "    Входит ли введенная дата в промежуток с "; startPeriod.print();
    std::cout << "    по "; endPeriod.print();
    std::cout << "    Ответ: " << (d1.isWithinRange(startPeriod, endPeriod) ? "Да, входит" : "Нет, не входит") << "\n";

    return 0;
}
